thanks for the issue and sorry to hear you're having issues. i've taken your reproduction but unable to reproduce the issue you're seeing.

```hcl
resource "cloudflare_tunnel" "example" {
  account_id = var.cloudflare_account_id
  name       = "my-example-tunnel"
  secret     = "AQIDBAUGBwgBAgMEBQYHCAECAwQFBgcIAQIDBAUGBwg="
}

resource "cloudflare_tunnel_config" "tunnel_config" {
  account_id = var.cloudflare_account_id
  tunnel_id  = cloudflare_tunnel.example.id
  config {
    warp_routing {
      enabled = true
    }
    ingress_rule {
      service  = "http://10.10.0.10:8080"
      hostname = "foobar.com"
    }
    ingress_rule {
      service = "http_status:404"
    }
  }
}
```

```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_tunnel.example will be created
  + resource "cloudflare_tunnel" "example" {
      + account_id   = "f037e56e89293a057740de681ac9abbe"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "my-example-tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # cloudflare_tunnel_config.tunnel_config will be created
  + resource "cloudflare_tunnel_config" "tunnel_config" {
      + account_id = "f037e56e89293a057740de681ac9abbe"
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = "foobar.com"
              + service  = "http://10.10.0.10:8080"
            }
          + ingress_rule {
              + service = "http_status:404"
            }
          + warp_routing {
              + enabled = true
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_tunnel.example: Creating...
cloudflare_tunnel.example: Creation complete after 2s [id=1060ca8c-3684-4fdf-bc57-800b4779901e]
cloudflare_tunnel_config.tunnel_config: Creating...
cloudflare_tunnel_config.tunnel_config: Creation complete after 1s [id=1060ca8c-3684-4fdf-bc57-800b4779901e]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

```
$ terraform apply
cloudflare_tunnel.example: Refreshing state... [id=1060ca8c-3684-4fdf-bc57-800b4779901e]
cloudflare_tunnel_config.tunnel_config: Refreshing state... [id=1060ca8c-3684-4fdf-bc57-800b4779901e]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

are you sure you're able to replicate this on a new resource with the latest version?